#
# Utility

brew 'neofetch'
brew 'wget'
brew 'git'
brew 'jq'
brew 'wget'
brew 'htop'
brew 'iproute2mac'
brew 'watch'

# Communication

cask 'slack'
# cask microsoft-teams

# browser

cask 'microsoft-edge'
cask 'firefox'

# development
brew 'nodejs'
cask 'postman'
cask 'iterm2'

cask 'studio-3t'

## container, k8s, docker
# cask 'docker'
cask 'rancher'
brew 'lima'
brew 'nerdctl'
brew 'skopeo'
brew 'k9s'
cask 'lens'

## Editor&Note
cask 'visual-studio-code'
brew 'vim'
cask 'notion'

# System

## https://github.com/koekeishiya/yabai/wiki/Installing-yabai-(latest-release)
brew 'koekeishiya/formulae/yabai'
## https://github.com/koekeishiya/skhd#install
brew 'koekeishiya/formulae/skhd'
## https://github.com/cmacrae/spacebar
brew 'cmacrae/formulae/spacebar'

## Launcher
cask 'raycast'
cask 'alt-tab'
brew 'fzf'
brew 'fasd'
brew 'terminal-notifier'
